# Merging Data Frames

## merge() function works like joins in SQL. It is used to merge Data Frames together.

In [2]:
from pandas import *

In [35]:
df1=read_csv('E:\Records.csv').tail(3)
df1=df1[['Region','Country']]
df1

                Region       Country
97  Sub-Saharan Africa  Sierra Leone
98       North America        Mexico
99  Sub-Saharan Africa    Mozambique

In [36]:
df2=read_csv('E:\Records.csv').head(3)
df2=df2[['Region','Country','Ship Date','Units Sold']]
df2

                              Region  Country   Ship Date  Units Sold
0              Australia and Oceania   Tuvalu   6/27/2010        9925
1  Central America and the Caribbean  Grenada   9/15/2012        2804
2                             Europe   Russia  05-08-2014        1779

In [39]:
df3=merge(df1,df2,on=['Region','Country'])
df3

Empty DataFrame
Columns: [Region, Country, Ship Date, Units Sold]
Index: []

In [40]:
dff1=DataFrame({'ID':[1,2,3],'Name':['A','B','C']})
dff1

   ID Name
0   1    A
1   2    B
2   3    C

In [43]:
dff2=DataFrame({'ID':[1,2,3],'Class':['X','XI','XII']})
dff2

   ID Class
0   1     X
1   2    XI
2   3   XII

In [44]:
dff3=merge(dff1,dff2,on='ID')
dff3

   ID Name Class
0   1    A     X
1   2    B    XI
2   3    C   XII

# Concat Data Frames

## Concat() function is used to add Data Frames together in stack form.

In [46]:
df10=read_csv('E:\Records.csv').head(2)
df10=df10[['Region','Country','Ship Date','Units Sold']]
df10

                              Region  Country  Ship Date  Units Sold
0              Australia and Oceania   Tuvalu  6/27/2010        9925
1  Central America and the Caribbean  Grenada  9/15/2012        2804

In [48]:
df11=read_csv('E:\Records.csv').tail(2)
df11=df11[['Region','Country','Ship Date','Units Sold']]
df11

                Region     Country   Ship Date  Units Sold
98       North America      Mexico  08-08-2015        5767
99  Sub-Saharan Africa  Mozambique   2/15/2012        5367

In [49]:
df12=concat([df10,df11])
df12

                               Region     Country   Ship Date  Units Sold
0               Australia and Oceania      Tuvalu   6/27/2010        9925
1   Central America and the Caribbean     Grenada   9/15/2012        2804
98                      North America      Mexico  08-08-2015        5767
99                 Sub-Saharan Africa  Mozambique   2/15/2012        5367

# Join Data Frames

## join() function is used to join the Data Frames if key not matched.

In [53]:
d1=read_csv('E:\Records.csv',nrows=3)
d1=d1[['Region','Country','Ship Date']]
d1

                              Region  Country   Ship Date
0              Australia and Oceania   Tuvalu   6/27/2010
1  Central America and the Caribbean  Grenada   9/15/2012
2                             Europe   Russia  05-08-2014

In [55]:
d2=read_csv('E:\Records.csv').tail(3)
d2=d2[['Item Type','Unit Price']]
d2

        Item Type  Unit Price
97     Vegetables      154.06
98  Personal Care       81.73
99      Household      668.27

In [56]:
d3=d1.join(d2)
d3

,Region,Country,Ship Date,Item Type,Unit Price
0,Australia and Oceania,Tuvalu,6/27/2010,NaN,NaN
1,Central America and the Caribbean,Grenada,9/15/2012,NaN,NaN
2,Europe,Russia,05-08-2014,NaN,NaN